Dlubal.RFEM5.LoadObjectType
Type of load objects.

Dlubal.RFEM5.LoadObjectType.UnknownLoadObject
Unknown load

Dlubal.RFEM5.LoadObjectType.NodalLoadObject
Nodal load

Dlubal.RFEM5.LoadObjectType.MemberLoadObject
Member load

Dlubal.RFEM5.LoadObjectType.LineLoadObject
Line load

Dlubal.RFEM5.LoadObjectType.SurfaceLoadObject
Surface load

Dlubal.RFEM5.LoadObjectType.SolidLoadObject
Solid load

Dlubal.RFEM5.LoadObjectType.FreeConcentratedLoadObject
Free concentrated load

Dlubal.RFEM5.LoadObjectType.FreeLineLoadObject
Free line load

Dlubal.RFEM5.LoadObjectType.FreeRectangularLoadObject
Free rectangular load

Dlubal.RFEM5.LoadObjectType.FreeCircularLoadObject
Free circular load

Dlubal.RFEM5.LoadObjectType.FreePolygonLoadObject
Free polygon load

Dlubal.RFEM5.LoadObjectType.FreeVariableLoadObject
Free variable load

Dlubal.RFEM5.LoadObjectType.ImposedNodalDeformationObject
Imposed nodal deformation

Dlubal.RFEM5.LoadObjectType.ImposedLineDisplacementObject
Imposed line displacement

Dlubal.RFEM5.LoadObjectType.ImperfectionObject
Imperfection